Repository: Ascaf0/openSUSE-manuals-it
Catalog: opensuse-manuals_12.2_src_*/xml/1_click_install_i.*.po
Languages: it

source: Installation using <literal>1-Click Install</literal> is available from a lot of repositories available on Web interfaces. A very popular interface is the openSUSE Build Service software search.
it: L'installazione prevista con <literal>1-Click Install</literal> è disponibile in molte repositories del Web. Una delle più popolari è la ricerca software openSUSE Build Service.

source: Installing Packages from the openSUSE Build Service via <literal>1-Click Install</literal>
it: Installazione dei pacchetti da openSUSE Build Service tramite <literal>1-Click Install</literal>

source: Start the openSUSE Build Service search interface at <ulink url="http://software.opensuse.org/search"/>.
it: Avviare l'interfaccia di ricerca openSUSE Build Service su <ulink url="http://software.opensuse.org/search"/>.

source: Select your system version from the drop-down menu, for example <emphasis><phrase os="osuse">openSUSE</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase><phrase os="osuse">12.2</phrase><phrase os="sles;sled">11 SP2</phrase><phrase os="sled">11 SP2</phrase></emphasis>.
it: Selezionare la versione del sistema operativo dal menu, per esempio <emphasis><phrase os="osuse">openSUSE</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase><phrase os="osuse">12.2</phrase><phrase os="sles;sled">11 SP2</phrase><phrase os="sled">11 SP2</phrase></emphasis>.

source: Enter the name of the package you want to install, for example the OpenStreetMap editor <systemitem>josm</systemitem>.
it: Digitare il nome del pacchetto che desideri installare, per esempio l'editor OpenStreetmap <systemitem>josm</systemitem>.

source: To refine the search, adjust the <guimenu>Search Options</guimenu> according to your wishes.
it: Per affinare ciò che vuoi, affina le <guimenu> Opzioni di Ricerca </guimenu>.

source: Click <guimenu>Search</guimenu>.
it: Premi <guimenu>Cerca</guimenu>.

source: From the results list select the preferred item by clicking its <guimenu>1-Click Install</guimenu> button.
it: Dalla lista selezionare la voce desiderata cliccando il pulsante<guimenu>1-Click Install</guimenu>.

source: In the Web browser's download dialog, select to open the file with the <guimenu>YaST Meta Package Handler</guimenu>.
it: Nella finestra di download del browser Web, seleziona per aprire il file con <guimenu>YaST Meta Package Handler</guimenu>.

source: The 1-click installer opens the <guimenu>Additional Software Repositories</guimenu> dialog. It shows the repositories providing the packages you want to install per <literal>1-Click Install</literal>. They are activated per default. To proceed with the installation, keep the repository selection. By default, you remain subscribed to these repositories after the installation has finished and you will receive updates from them in the future.
it: La voce 1-click installer apre la finestra <guimenu>Repositories Software Addizionale</guimenu> che fornisce i pacchetti che potranno essere installati tramite <literal>1-Click Install</literal> che sono attivati per default. Procedere con l'installazione, mantenere la selezione del repository. Per default, rimarranno caricati questi repositories. Al termine dell'installazione sarà probabile ricevere aggiornamenti.

source: If you want to use the new repositories only once instead, uncheck <guimenu>Remain Subscribed to These Repositories after Installation</guimenu>. Click <guimenu>Next</guimenu> to proceed.
it: Se si vogliono usare nuovi repositories, deselezionare <guimenu> Al termine dell'installazione mantenere la sottoscrizione a questi Repositories</guimenu>. Premere <guimenu>Avanti</guimenu> per proseguire.

source: Now select the software packages that should be installed. Normally there is no need to change the default selection. Click <guimenu>Next</guimenu> to proceed.
it: Selezionare i pacchetti software che si vogliono installare. Normalmente non è richiesto di cambiare la selezione di default. Premere <guimenu>Avanti</guimenu> per proseguire.

source: The <guimenu>Proposal</guimenu> screen summarizes the choices you made. Click <guimenu>Customize</guimenu> to restart the configuration steps from above. Click <guimenu>Next</guimenu> and <guimenu>Yes</guimenu> to proceed with the installation.
it: La videata <guimenu>Proposta</guimenu> visualizza il riepilogo delle scelte effettuate. Premere <guimenu>Personalizza</guimenu> per riavviare la configurazione. Premere <guimenu>Avanti</guimenu> e <guimenu>Sì</guimenu> per procedere con l'installazione.

source: Enter the <systemitem class="username">root</systemitem> password to start the installation. In case a new repository has been added you also need to confirm the import of the repository's GPG key. During the installation several progress pop-ups appear that do not need any interaction. After reading the <quote>Installation was successful</quote> message, click <guimenu>Finish</guimenu>.
it: Inserire la password di <systemitem class="username">amministratore</systemitem> per avviare l'installazione. Nel caso fossero aggiunte nuove repositories sarà necessario confermare l'importazione delle chiavi GPG. Durante il processo di installazione saranno visibili finestre di interazione cui non è richiesto l'intervento da parte dell'utente. Dopo aver letto il messaggio <quote>Installazione riuscita</quote>, premere <guimenu>Fine</guimenu>.

source: Disabling 1-Click Install Feature
it: Disabilita la funzione 1-Click Install

source: If you want to disable the 1-Click install feature, uninstall the <systemitem>yast2-metapackage-handler</systemitem> package using YaST. Alternatively, enter the following command as <systemitem class="username">root</systemitem>:
it: Se si vuole disabilitare la funzione 1-Click Install, rimuovere il metapacchetto <systemitem>yast2-metapackage-handler</systemitem> utilizzando YaST. In alternativa inserire il comando seguente <systemitem class="username">root</systemitem>:

source: translator-credits
it: ludovico.salemi@gmail.com, 2013
